<?php
return [
    'SELF_BOT_JOIN_MESSAGE' => 'Привет! Хочешь получать автоматические уведомления о заменах? Пиши команду "/группа тут_нужно_указать_код_группы" и проверь правилность командой "/замены"(покажет все актуальные замены для группы), подробнее в сообществе!',
    'GROUP_ADD_MESSAGE' => "Оповещения об изменениях в расписании для групп(-ы) %s включены!\nОшиблись в названии групп(ы)? -- повторите команду!",
    'TEACHER_ADD_MESSAGE' => "Оповещения об изменениях в расписании для препреподавателя %s включены!\nОшиблись в инициалах? -- повторите команду!",
    'DISABLE_NOTIFY' => 'Оповещения выключены!',
    'ENABLE_NOTIFY' => 'Оповещения включены',
    'TEACHER_NOT_MATCH' => "Иницыалы не соответствуют правилам, попробуйте заново.\n Примеры: 'Афанасьев А.А.', 'Яблокова А.И.'",
    'GROUP_NOT_MATCH' => "Название группы не соответствует правилам, попробуйте заново.\nПримеры: '2ЗИО-9', '2БД-9, 1БД-11', '1ИСП9-2'",
    'REPLACES_TEMPLATE' => "Изменения в расписании для %s: \r\n Файл с изменениями: \r\n %s -- %s",
    'REPLACES_TEMPLATE_MASS' => "Изменения в расписании для %s: \r\n Файлы с изменениями:\r\n",
    'TIMETABLE_LINK' => "Расписание колледжа: http://academicol.ru/students/schedule/",
    'NO_REPLACES_TEMPLATE' => "-- Не удалось найти актуальных замен.\r\n",
    'EXCEPTION' => [
        'DATE' => '[Exception]: возникла ошибка ',
        'TEXT' => '[Exception]: текст: ',
        'CODE' => '[Exception]: код ошибки: ',
        'FILE' => '[Exception]: файл: ',
        'PATH' => '[Exception]: путь ошибки: '
    ]
];
